           INITIALIZE OUTPUT-RECORD.
           STRING MARGIN-5,SPACE,
           COMMENT-LINE INTO OUTPUT-RECORD.
           WRITE OUTPUT-RECORD.

           INITIALIZE OUTPUT-RECORD.
           STRING MARGIN-11 "DATA DIVISION." 
           INTO OUTPUT-RECORD.
           WRITE OUTPUT-RECORD.
           