           INITIALIZE OUTPUT-RECORD.
           MOVE COMMENT-LINE TO OUTPUT-RECORD.
           WRITE OUTPUT-RECORD.
           
           INITIALIZE OUTPUT-RECORD.
           STRING MARGIN-7, "PROCEDURE DIVISION"
           INTO OUTPUT-RECORD. 
           WRITE OUTPUT-RECORD.